src/Documents/Крафт/Крафт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Крафт</name>
  <registerRecords>AccumulationRegister.Камни</registerRecords>
  <registerRecords>AccumulationRegister.Руны</registerRecords>
  <attributes>
    <name>Результат</name>
    <type>
      <types>CatalogRef.РунныеСлова</types>
      <types>CatalogRef.Рецепты</types>
    </type>
  </attributes>
  <attributes>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.Руны</types>
        <types>CatalogRef.Камни</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/РунныеСлова/РунныеСлова.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РунныеСлова</name>
  <attributes>
    <name>КоличествоРун</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаРунном</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Руны</name>
    <attributes>
      <name>Руна</name>
      <type>
        <types>CatalogRef.Руны</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоддерживаемыйШмот</name>
    <attributes>
      <name>Шмот</name>
      <type>
        <types>CatalogRef.ВидыШмота</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Рецепты/Рецепты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рецепты</name>
  <attributes>
    <name>Результат</name>
    <type>
      <types>CatalogRef.Руны</types>
      <types>CatalogRef.Камни</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рецепт</name>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.Руны</types>
        <types>CatalogRef.Камни</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Крафт/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьПоРецепту()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РунныеСловаРуны.Руна КАК Предмет,
	|	КОЛИЧЕСТВО(РунныеСловаРуны.Руна) КАК Количество
	|ИЗ
	|	Справочник.РунныеСлова.Руны КАК РунныеСловаРуны
	|ГДЕ
	|	РунныеСловаРуны.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РунныеСловаРуны.Руна
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РецептыРецепт.Предмет,
	|	КОЛИЧЕСТВО(РецептыРецепт.Предмет)
	|ИЗ
	|	Справочник.Рецепты.Рецепт КАК РецептыРецепт
	|ГДЕ
	|	РецептыРецепт.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РецептыРецепт.Предмет";
	Запрос.УстановитьПараметр("Ссылка", Объект.Результат);
	
	Объект.Ресурсы.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	ЗаполнитьПоРецепту();
КонецПроцедуры
